# EnergyAnalysisRoomSpaceData Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
GroupTypeId..::..EnergyAnalysisRoomSpaceData Property
GroupTypeId Class See Also
---
"Room/Space Data"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EnergyAnalysisRoomSpaceData { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnergyAnalysisRoomSpaceData As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EnergyAnalysisRoomSpaceData {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace